<img src="https://pardee.du.edu/sites/default/files/PardeeCenterLogo_finalnew.png" />
<p style="text-align: center;">yutang.xiong@du.edu </p>

In [1]:
import pandas as pd
import re
import time
import numpy as np
import os
import random as rd

<img src="Pics/Double-Loop-learning.png" width=300 height=200 />


# Loop  
- While loop:<br>
You don't know how many times the operation is going to run, but you have an idea about when it should stop- until a condition is met
- For loop:<br>
You know how many time you are going to repeat the operation

In [8]:
# Q: How many times you need to get a 6 rolling a dice? 
# number_rolled=[]
initial_condition=True
count=0

#  or while initial_condition:
while initial_condition==True:  
    
    # or count+=1
    dice=rd.randint(1,6)
    count=count+1
    # number_rolled.append(dice)
    
    if dice==6:
        print("You got it!")
        initial_condition=False
    else:
        print("Number is",dice,";Try again!")

Number is 1 ;Try again!
Number is 2 ;Try again!
Number is 5 ;Try again!
Number is 4 ;Try again!
You got it!

In [9]:
# very arbitary result
count

5

In [4]:
# On average, how many time you need to get a 6 rolling a dice?
counter=[]
for i in range(0,1000):
    initial_condition=True
    count=0

    #  or while initial_condition:
    while initial_condition==True:  

        # or count+=1
        dice=rd.randint(1,6)
        count=count+1
        # number_rolled.append(dice)

        if dice==6:
            initial_condition=False
            
    counter.append(count)

In [5]:
# np.mean(counter)

In [14]:
# use of range() function
for i in range(0,10,2):
    print(i)

0
2
4
6
8

In [41]:
for i in range(3):
    print(i)

0
1
2

In [49]:
for i in range(5,0,-2):
    print(i)

5
3
1

# A pandas dataframe example

- Goal is to add most recent & earliest columns into the data <br>
Note: I'm using probably the dumbest way here to achieve the goal. Please share with the team if you have any suggestons on the efficiency improvement.

In [50]:
dt=pd.read_excel("Sample Data/SeriesUNCTADTariffRevCountry.xlsx")

In [51]:
# as always, check some basic attributes of the data
print(dt.shape)
dt.head(5)

(34410, 10)

,Actor,Partner,Actor_FIPS,Partner_FIPS,2010,2011,2012,2013,2014,2015
0,Afghanistan,Albania,AFG,ALB,NaN,NaN,26.305618,25.925867,NaN,NaN
1,Afghanistan,Algeria,AFG,DZA,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,Angola,AFG,AGO,NaN,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,Argentina,AFG,ARG,NaN,NaN,16301.528038,16066.196887,NaN,NaN
4,Afghanistan,Armenia,AFG,ARM,NaN,NaN,NaN,NaN,NaN,NaN

In [52]:
dt.dtypes

Actor            object
Partner          object
Actor_FIPS       object
Partner_FIPS     object
2010            float64
2011            float64
2012            float64
2013            float64
2014            float64
2015            float64
dtype: object

In [68]:
# use of iloc: pure postition based selection (different than index based), starting from postion 0
# use of loc: index based selection, starting from index 0
dt.sort_values(by=["Partner","Actor"],inplace=True)
dt.head(10)

,Actor,Partner,Actor_FIPS,Partner_FIPS,2010,2011,2012,2013,2014,2015
185,Albania,Afghanistan,ALB,AFG,236.641077,NaN,17.635051,688.121749,NaN,NaN
370,Algeria,Afghanistan,DZA,AFG,NaN,NaN,NaN,NaN,51.594129,13346.894415
555,Angola,Afghanistan,AGO,AFG,26332.086222,35390.8100,50192.226989,19124.261503,17507.759768,26881.034743
740,Argentina,Afghanistan,ARG,AFG,NaN,1428.6457,1960.482398,36564.731330,35981.051114,498.711886
925,Armenia,Afghanistan,ARM,AFG,1147.203755,0.0000,198.884191,471.686627,0.000000,1.518467
1110,Australia,Afghanistan,AUS,AFG,0.000000,0.0000,0.000000,0.000000,0.000000,0.000000
1295,Austria,Afghanistan,AUT,AFG,NaN,NaN,NaN,NaN,NaN,NaN
1480,Azerbaijan,Afghanistan,AZE,AFG,NaN,135.4050,NaN,NaN,NaN,NaN
1665,"Bahamas, The",Afghanistan,BHS,AFG,NaN,NaN,NaN,NaN,NaN,120.528287
1850,Bahrain,Afghanistan,BHR,AFG,3832.007146,3104.0000,3041.066648,1992.670812,NaN,3376.580790

In [69]:
print(dt.iloc[2,1]) # is getting values at row position-2 and column position-1
print(dt.loc[185,"Actor"]) # is getting values at row position-2 and column position-1
print("-------------")
print(dt.iloc[2,:5]) # is getting values at row position-2 and column up to position-4

Afghanistan
Albania
-------------
Actor                Angola
Partner         Afghanistan
Actor_FIPS              AGO
Partner_FIPS            AFG
2010                26332.1
Name: 555, dtype: object

In [70]:
print(type(dt.iloc[0,4:]))
dt.iloc[0,4:]

<class 'pandas.core.series.Series'>

2010    236.641
2011        NaN
2012    17.6351
2013    688.122
2014        NaN
2015        NaN
Name: 185, dtype: object

In [71]:
dt.iloc[0,4:].dropna()

2010    236.641
2012    17.6351
2013    688.122
Name: 185, dtype: object

In [72]:
dt.loc[1295,[2010,2011,2012,2013,2014,2015]]

2010    NaN
2011    NaN
2012    NaN
2013    NaN
2014    NaN
2015    NaN
Name: 1295, dtype: object

In [77]:
dt.loc[1295,[2010,2011,2012,2013,2014,2015]].dropna()

Series([], Name: 1295, dtype: object)

In [80]:
# use of empty or len()
print( len(dt.loc[1295,[2010,2011,2012,2013,2014,2015]].dropna()) )
dt.loc[1295,[2010,2011,2012,2013,2014,2015]].dropna().empty

0

True

In [81]:
# prepare empty lists
E=[]
R=[]   
for l in range(dt.shape[0]): 
    line=dt.iloc[l,4:].dropna()
    
    if len(line)>0: # or if not line.empty
        E.append(line.values[0])
        R.append(line.values[-1])
    else:
        E.append(np.NaN)
        R.append(np.NaN)
dt['Earliest']=E
dt['MostRecent']=R

In [82]:
dt

,Actor,Partner,Actor_FIPS,Partner_FIPS,2010,2011,2012,2013,2014,2015,Earliest,MostRecent
185,Albania,Afghanistan,ALB,AFG,236.641077,NaN,17.635051,688.121749,NaN,NaN,236.641077,6.881217e+02
370,Algeria,Afghanistan,DZA,AFG,NaN,NaN,NaN,NaN,5.159413e+01,1.334689e+04,51.594129,1.334689e+04
555,Angola,Afghanistan,AGO,AFG,26332.086222,35390.8100,50192.226989,19124.261503,1.750776e+04,2.688103e+04,26332.086222,2.688103e+04
740,Argentina,Afghanistan,ARG,AFG,NaN,1428.6457,1960.482398,36564.731330,3.598105e+04,4.987119e+02,1428.645700,4.987119e+02
925,Armenia,Afghanistan,ARM,AFG,1147.203755,0.0000,198.884191,471.686627,0.000000e+00,1.518467e+00,1147.203755,1.518467e+00
...,...,...,...,...,...,...,...,...,...,...,...,...
33484,Vanuatu,Zimbabwe,VUT,ZWE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33669,Venezuela,Zimbabwe,VEN,ZWE,6092.991940,28038.4125,27469.935927,27073.376071,NaN,NaN,6092.991940,2.707338e+04
33854,Vietnam,Zimbabwe,VNM,ZWE,664457.505616,NaN,718124.865405,707757.913898,1.849940e+06,2.592275e+06,664457.505616,2.592275e+06
34039,"Yemen, Republic of",Zimbabwe,YEM,ZWE,NaN,155501.9701,122067.564265,626.710758,NaN,1.064261e+05,155501.970100,1.064261e+05
34224,Zambia,Zimbabwe,ZMB,ZWE,523983.668714,0.0000,0.000000,0.000000,NaN,4.719869e+05,523983.668714,4.719869e+05